jclab-joseph/mimxrt-usb-sd-msd/sdmmc/src/fsl_sd.c
    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    uint32_t i                   = FSL_SDMMC_MAX_CMD_RETRIES;
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSD_SendInterfaceCondition;
    command.argument     = 0x1AAU;
    command.responseType = kCARD_ResponseTypeR7;

    content.command = &command;
    content.data    = NULL;
    do
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            SDMMC_LOG("\r\nError: send CMD8 failed with host error %d, response %x\r\n", error, command.response[0U]);
        }
        else
        {
            if ((command.response[0U] & 0xFFU) != 0xAAU)
            {
                error = kStatus_SDMMC_CardNotSupport;
                SDMMC_LOG("\r\nError: card not support CMD8\r\n");
            }
            else
            {
                error = kStatus_Success;
            }
        }
    } while ((--i != 0U) && (error != kStatus_Success));

    return error;
}

static status_t SD_SelectBusTiming(sd_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_SDMMC_SwitchBusTimingFailed;

    if (card->operationVoltage != kSDMMC_OperationVoltage180V)
    {
        /* group 1, function 1 ->high speed mode*/
        error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR25HighSpeed);
        /* If the result isn't "switching to high speed mode(50MHZ) successfully or card doesn't support high speed
         * mode". Return failed status. */
        if (error == kStatus_Success)
        {
            card->currentTiming = kSD_TimingSDR25HighSpeedMode;
            card->busClock_Hz =
                SDMMCHOST_SetCardClock(card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
        }
        else
        {
            if (error == kStatus_SDMMC_NotSupportYet)
            {
                /* if not support high speed, keep the card work at default mode */
                SDMMC_LOG("\r\nNote: High speed mode is not supported by card\r\n");
                return kStatus_Success;
            }
        }
    }
    /* card is in UHS_I mode */
    else
    {
        do
        {
            if (card->currentTiming == kSD_TimingSDR12DefaultMode)
            {
                /* if timing not specified, probe card capability from SDR104 mode */
                card->currentTiming = kSD_TimingSDR104Mode;
            }

            if (card->currentTiming == kSD_TimingSDR104Mode)
            {
                if ((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR104) != 0U)
                {
                    error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR104);
                    if (error == kStatus_Success)
                    {
                        card->currentTiming = kSD_TimingSDR104Mode;
                        card->busClock_Hz   = SDMMCHOST_SetCardClock(
                            card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_208MHZ));
                        break;
                    }
                }
                SDMMC_LOG("\r\nNote: SDR104 mode is not supported\r\n");
                card->currentTiming = kSD_TimingDDR50Mode;
            }

            if (card->currentTiming == kSD_TimingDDR50Mode)
            {
                error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionDDR50);
                if (error == kStatus_Success)
                {
                    card->currentTiming = kSD_TimingDDR50Mode;
                    card->busClock_Hz   = SDMMCHOST_SetCardClock(
                        card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
                    SDMMCHOST_EnableDDRMode(card->host, true, 0U);
                    break;
                }
                SDMMC_LOG("\r\nNote: DDR50 mode is not supported\r\n");
                card->currentTiming = kSD_TimingSDR50Mode;
            }

            if (card->currentTiming == kSD_TimingSDR50Mode)
            {
                if ((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR50) != 0U)
                {
                    error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR50);
                    if (error == kStatus_Success)
                    {
                        card->currentTiming = kSD_TimingSDR50Mode;
                        card->busClock_Hz   = SDMMCHOST_SetCardClock(
                            card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_100MHZ));
                        break;
                    }
                }
                SDMMC_LOG("\r\nNote: SDR50 mode is not supported\r\n");
                card->currentTiming = kSD_TimingSDR25HighSpeedMode;
            }

            if (card->currentTiming == kSD_TimingSDR25HighSpeedMode)
            {
                error = SD_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR25HighSpeed);
                if (error == kStatus_Success)
                {
                    card->currentTiming = kSD_TimingSDR25HighSpeedMode;
                    card->busClock_Hz   = SDMMCHOST_SetCardClock(
                        card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
                    break;
                }
            }

            SDMMC_LOG("\r\nWarning: unknown timing mode\r\n");
        } while (false);
    }

    if (error == kStatus_Success)
    {
        /* Update io strength according to different bus frequency */
        if (card->usrParam.ioStrength != NULL)
        {
            card->usrParam.ioStrength(card->busClock_Hz);
        }

        /* SDR50 and SDR104 mode need tuning */
        if ((card->currentTiming == kSD_TimingSDR50Mode) || (card->currentTiming == kSD_TimingSDR104Mode))
        {
            /* execute tuning */
            if (SD_ExecuteTuning(card) != kStatus_Success)
            {
                SDMMC_LOG("\r\nError: tuning failed for mode %d\r\n", card->currentTiming);
                return kStatus_SDMMC_TuningFail;
            }
        }
    }

    return error;
}

static void SD_DecodeStatus(sd_card_t *card, uint32_t *src)
{
    assert(card != NULL);
    assert(src != NULL);

